<template>
  <div class="container">
    <main class="main">
      <h2 class="main__title">
        Общая информация
      </h2>
      <h3 class="main__subtitle">
        О проекте
      </h3>
      <p class="main__text">
        Привет! Эту барахолку я решил создать, дабы облегчить поиск и покупку страйкбольного снаряжения. Проект был создан
        на добровольной основе вместе с моими товарищами. В дальнейшем проект будет развиваться и будут добавляться новые
        фичи, такие как полнотекстовый поиск, поиск по параметрам товаров, система чатов и т.д. Любая поддержка и идеи
        приветствуются!
      </p>
      <h3 class="main__subtitle">
        Немного обо мне
      </h3>
      <p class="main__text">
        Мой позывной Бехрам. Играю в СК "Звено". Начинал заниматься страйкболом еще когда учился в военной академии в 2016
        году. Наверное, у любого страйкболиста со временем начинается перфекционизм и клептомания, когда хочется все свое
        снаряжение довести до идеала и еще купить лучшие стволы и тд). Так вот, когда я дошел до такой стадии, то начал
        зависать на страйкбольных барахолках, которые, к моему удивлению, были расположены, по большей части, «в
        контакте». Никакого поиска, никакого удобства, просто сидишь и листаешь ленту. Ну и, соответственно, у меня
        возникло желание сделать что-то более удобное. К тому же, в ту пору я начал увлекаться программированием. У меня
        получилось привлечь несколько друзей еще с военной академии, которые тоже начинали свою IT-карьеру. И в свободное
        время мы стали пилить барахолку. Результаты нашей работы вы можете увидеть перед собой)
      </p>
      <h3 class="main__subtitle">
        Правила пользования
      </h3>
      <ol class="ordered-list">
        <li class="ordered-list__item">
          Публикация объявлений
          <ul class="unordered-list">
            <li class="unordered-list__item">
              Не публикуйте в одном объявление больше одного товара, такие публикации будут отклонены модерацией. Это
              необходимо для облегчения поиска товаров покупателями.
            </li>
            <li class="unordered-list__item">
              В объявлениях старайтесь максимально подробно описывать товар, это облегчит задачу выбора покупателю, а
              продавца избавит от лишних вопросов.
            </li>
            <li class="unordered-list__item">
              Объявления с некорректными высказываниями будут отклонены модераторами.
            </li>
            <li class="unordered-list__item">
              В настоящий момент разрешено не более 5 активных объявлений. Это временная мера, которая вызвана нехваткой
              вычислительных мощностей.
            </li>
            <li class="unordered-list__item">
              На платформе запрещена публикация объявлений, содержащих товары не страйкбольного назначения.
            </li>
            <li class="unordered-list__item">
              На платформе запрещена публикация объявлений с целью рекламы чего-либо.
            </li>
          </ul>
        </li>
        <li class="ordered-list__item">
          В настоящий момент на платформе не реализована система чатов, поэтому в профиле продавца вы можете увидеть его
          контакты под аватаром.
        </li>
        <li class="ordered-list__item">
          Поиск товаров пока осуществляется только через категории, позже будет добавлен полнотекстовый поиск. И поиск по
          параметрам товаров.
        </li>
        <li class="ordered-list__item">
          При возникновении каких-либо вопросов, Вы можете написать на почту
          <a
            class="ordered-list__link"
            href="mailto:bexram33@mail.ru"
          >bexram33@mail.ru</a> или в
          <a
            class="ordered-list__link"
            href="https://t.me/zloytard"
          >https://t.me/zloytard</a>
        </li>
        <li class="ordered-list__item">
          Платформа не собирает ваши личные данные, за исключением контактов, для общения с покупателями. Регистрируясь
          на нашей платформе, вы даете разрешение на публикацию ваших контактов.
        </li>
        <li class="ordered-list__item">
          Платформа не несет ответственности за общение пользователей за ее пределами.
        </li>
      </ol>
    </main>
  </div>
</template>

<script setup>
</script>

<style lang="scss" scoped>
.main {
  margin-bottom: 5rem;
  background: $white;
  border: 1px solid $filter-border;
  box-shadow: 0px 9px 100px rgba(255, 255, 255, 0.72);
  border-radius: 15px;
  padding: 2.5rem 3rem;

  @media (max-width: 1150px) {
    padding: 1.5rem 2.5rem;
  }

  @media (max-width: 750px) {
    padding: 0;
    border: none;
  }

  @media (max-width: 1150px) {
    margin-bottom: 6rem;
  }

  &__title {
    @include defineFontMontserrat(600, 27px, 33px);
    margin-bottom: 1rem;
  }

  &__subtitle {
    @include defineFontMontserrat(600, 18px, 22px);
    margin-bottom: 1rem;
  }

  &__text {
    @include defineFontMontserrat(400, 15px, 1.4);
    margin-bottom: 1rem;
  }
}

.ordered-list {
  @include defineFontMontserrat(400, 15px, 1.4);
  padding: 0 1rem;

  &__item {
    margin-bottom: 0.5rem;
  }

  &__link {
    @include defineFontMontserrat(400, 15px, 1.4);
    color: inherit;
  }
}

.unordered-list {
  @include defineFontMontserrat(400, 15px, 1.4);
  padding: 0 1rem;

  &__item {
    margin-bottom: 0.5rem;
  }
}
</style>
